
let btngen = document.querySelector(".burunduker")
console.log(btngen);
let title = document.querySelector(".person__title")
console.log(title);
let desc = document.querySelector(".person__description")
console.log(desc);
let person = {
    vozrast: 20,
    Imya: 'Fon Shnizhyelli',
    Proffesia: 'Bughalter',
    Stashz: 120,
}

function random(min,max) {
    return Math.ceil(Math.random()*(max + min)+min)
}

console.log(person.Imya);
let personlist = document.querySelectorAll('.description__character')

let massprof = [
"Аудитор",
"Актуарий",
"Аналитик",
"Банкир",
"Брокер",
"Бухгалтер",
"Дилер",
"Продавец",
"Инкассатор",
"Коммерческий директор",
"Кредитный консультант",
"Маркетолог",
"Маклер биржевой",
"Менеджер по работе с клиентами",
"Налоговый инспектор",
"Операционист",
"Предприниматель",
"Сметчик",
"Снабженец",
"Страховой агент",
"Релайтер",
"Товаровед",
"Торговый представитель",
"Тренд-вотчер",
"Трейдер",
"Экономист",
"Экспедитор",
"Финансист",
"Кассир",
"Биоинженер",
"Учёный",
"Антрополог",
"Археолог",
"Архивариус",
"Астроном",
"Астрофизик",
"Астрохимик",
"Бактериолог",
"Биолог",
"Биофизик",
"Биохимик",
"Библиотекарь",
"Ботаник",
"Вирусолог",
"Востоковед",
"Генетик",
"Географ",
"Геодезист",
"Геолог",
"Гидролог",
"Гляциолог",
"Египтолог",
"Зоолог",
"Искусствовед",
"Историк",
"Ихтиолог",
"Логик",
"Криптозоолог",
"Культуролог",
"Лингвист",
"Математик",
"Миколог",
"Микробиолог",
"Метеоролог",
"Океанолог",
"Орнитолог",
"Палеонтолог",
"Политолог",
"Религиовед",
"Серпентолог",
"Социолог",
"Теолог",
"Териолог",
"Физик",
"Философ",
"Филолог",
"Футуролог",
"Химик",
"Эколог",
"Энтомолог",
'Администратор базы данных',
'Веб-интегратор',
'Веб-мастер',
'Монтажник связи',
'Оператор ПК',
'Программист',
'Кодер',
'Веб-программист',
'Радист',
'Робототехник',
'Системный администратор',
'Телеграфист',
'Телефонист',
'Тестировщик'
]
let massname = [
'Август',
'Августин',
'Авраам',
'Аврора',
'Агата',
'Агафон', 
'Агнесса', 
'Агния',
'Ада', 
'Аделаида', 
'Аделина', 
'Адонис', 
'Акайо' ,
'Акулина', 
'Алан',
'Алевтина', 
'Александр', 
'Александра', 
'Алексей', 
'Алена' ,
'Алина' ,
'Алиса' ,
'Алла ',
'Алсу ',
'Альберт', 
'Альбина', 
'Альфия', 
'Альфред',
'Амалия', 
'Амелия', 
'Анастасий', 
'Анастасия', 
'Анатолий', 
'Ангелина', 
'Андрей', 
'Анжела', 
'Анжелика',
'Анисий', 
'Анна ',
'Антон' ,
'Антонина', 
'Анфиса', 
'Аполлинарий', 
'Аполлон', 
'Ариадна', 
'Арина',
'Аристарх', 
'Аркадий', 
'Арсен',
'Арсений', 
'Артем' ,
'Артемий', 
'Артур' ,
'Архип' ,
'Ася',
'Беатрис',
'Белла', 
'Бенедикт', 
'Берта', 
'Богдан', 
'Божена', 
'Болеслав', 
'Борис', 
'Борислав', 
'Бронислав', 
'Бронислава', 
'Булат',
'Вадим', 
'Валентин', 
'Валентина', 
'Валерий', 
'Валерия', 
'Ванда', 
'Варвара', 
'Василий', 
'Василиса', 
'Венера', 
'Вениамин', 
'Вера', 
'Вероника', 
'Викентий', 
'Виктор', 
'Виктория', 
'Вилен', 
'Виолетта', 
'Виссарион', 
'Вита', 
'Виталий', 
'Влад', 
'Владимир', 
'Владислав', 
'Владислава', 
'Владлен', 
'Вольдемар', 
'Всеволод', 
'Вячеслав'
]

btngen.onclick = function genBurunduk() {
    title.style.opacity = 0;
    setTimeout(() => {
       title.style.display = 'none';
       desc.style.display = 'flex'
       setTimeout(() => {
           desc.style.opacity =  100
       }, 500);
    }, 500);
    person.vozrast = Math.ceil(Math.random()*(80-10)+10)
    person.Proffesia = massprof[Math.floor(Math.random() * (massprof.length))]
    person.Imya = massname[Math.floor(Math.random() * (massname.length))]
    console.log(person.Proffesia);
    person.Stashz = random(-1,person.vozrast/1.2)
    
    if (person.Stashz==0) {
        person.Proffesia = "Bezrabotniy"
    }
    personlist[1].innerHTML = person.vozrast
    personlist[3].innerHTML = person.Stashz
    personlist[2].innerHTML = person.Proffesia
    personlist[0].innerHTML = person.Imya

    
}



